ГТС/УТГТС/InformationRegisters/СостоянияДокументовEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовEDI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнееДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПроцессаЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторонаВыполнившаяДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтороныУчастникиСервисаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УточнениеСостоянияПоДаннымСтороныУчастника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУточнениеСостоянияПоДаннымСтороныУчастника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТекущегоСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТекущейВерсии</Name>
					<Comment>Номер последней загруженной в прикладной объект версии документа в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктуальнойВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрикладногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшТипаДокументаИСтатуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикладнойОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрикладнойОбъектEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПрикладногоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСоответствияПрикладногоОбъектаДокументуEDI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшОтправленногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУказанияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУказанияНоменклатурыБЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованнаяВерсияПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованнаяВерсияПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСопоставлениеНоменклатурыПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВСервисе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыДокументовEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовEDI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПоставщику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/CommonModules/РаботаСВерсиямиEDIСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПечатныеФормы


// Формирует отчет о сравнении версий документа сервиса по документу информационной базы
// 
// Параметры:
// 	Документ - ОпределяемыйТип.ПрикладнойДокументОбъектEDI - ссылка на документ информационной базы
// Возвращаемое значение:
// 	ТабличныйДокумент - сформированный сервисом отчет о сравнении версий
Функция СформироватьТекущиеОтличияДокумента(Документ) Экспорт
	
	ЗаписьРеестра = РегистрыСведений.СостоянияДокументовEDI.ЗаписиРеестраПоДокументам(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ)).Получить(Документ);
	
	Если ЗаписьРеестра = Неопределено Тогда
		ТекстИсключения = НСтр("ru = 'Формирование отчета о сравнении версий для документов, отсутствующих в сервисе, недоступно.'");
		ВызватьИсключение(ТекстИсключения);
	КонецЕсли;
	
	Если ЗаписьРеестра.ТипДокумента = Перечисления.ТипыДокументовEDI.ЗаказПоставщику Тогда
		
		ПараметрыПолученияПечатнойФормы = ИнтеграцияССервисомEDIСлужебный.НовыйПараметрыСравненияВерсийЗаказаПоставщику();
		
		ПараметрыПолученияПечатнойФормы.Организация            = ЗаписьРеестра.Организация;
		ПараметрыПолученияПечатнойФормы.ИдентификаторВСервисе  = ЗаписьРеестра.ИдентификаторВСервисе;
		ПараметрыПолученияПечатнойФормы.ИдентификаторВерсии1   = ЗаписьРеестра.СогласованнаяВерсияПоставщика;
		
		ОтветСервиса = ИнтеграцияССервисомEDIСлужебный.ПечатнаяФормаСравненияВерсийЗаказаПоставщику(ПараметрыПолученияПечатнойФормы);
		
	ИначеЕсли ЗаписьРеестра.ТипДокумента = Перечисления.ТипыДокументовEDI.ЗаказКлиента Тогда
		
		ПараметрыПолученияПечатнойФормы = ИнтеграцияССервисомEDIСлужебный.НовыйПараметрыСравненияВерсийЗаказаКлиента();
		
		ПараметрыПолученияПечатнойФормы.Организация            = ЗаписьРеестра.Организация;
		ПараметрыПолученияПечатнойФормы.ИдентификаторВСервисе  = ЗаписьРеестра.ИдентификаторВСервисе;
		ПараметрыПолученияПечатнойФормы.ИдентификаторВерсии1   = ЗаписьРеестра.СогласованнаяВерсияПокупателя;
		
		ОтветСервиса = ИнтеграцияССервисомEDIСлужебный.ПечатнаяФормаСравненияВерсийЗаказаКлиента(ПараметрыПолученияПечатнойФормы);
		
	КонецЕсли;
	
	Если ОтветСервиса.Ошибка Тогда
		ТекстИсключения = НСтр("ru = 'Не удалось сформировать отчет о сравнении версий.'");
		ВызватьИсключение(ТекстИсключения);
	КонецЕсли;
	
	Возврат ОтветСервиса.Данные.ОтчетОСравненииТолькоОтличия;
	
КонецФункции

#КонецОбласти

#Область СведенияОВерсияхДокумента

// Получает список версий документа из сервиса EDI
// 
// Параметры:
// 	Организация  - ОпределяемыйТип.ОрганизацияEDI       - организация документа
// 	ТипДокумента - ПеречислениеСсылка.ТипыДокументовEDI - тип документа сервиса
// 	Документ     - Строка                               - идентификатор документа сервиса
// Возвращаемое значение:
// 	ТаблицаЗначений -  см. РаботаСВерсиямиEDIСервер.НовыйТаблицаВерсий
Функция ПолучитьВерсииДокумента(Организация, ТипДокумента, Документ) Экспорт
	
	ТаблицаВерсийДокумента = НовыйТаблицаВерсий();
	
	РаботаСВерсиямиИнтеграцияEDIСервер.ПриЗаполненииВерсийДокумента(ТаблицаВерсийДокумента, Организация, ТипДокумента, Документ);
	
	Возврат ТаблицаВерсийДокумента;
	
КонецФункции

#КонецОбласти

#Область Конструкторы

// Конструктор новый таблицы версий документа сервиса
// 
// Возвращаемое значение:
// 	ТаблицаЗначений - Описание:
// * ИдентификаторВерсии - Строка - идентификатор версии документа сервиса
// * ПредставлениеВерсии - Строка - пользовательское представление версии документа
// * ПредставлениеАвтора - Строка - пользовательское представление автора версии
// * Дата                - Дата   - дата создания версии документа
// * Состояние           - Строка - идентификатор состояния документа сервиса
//
Функция НовыйТаблицаВерсий() Экспорт
	
	ТаблицаВерсий = Новый ТаблицаЗначений;
	
	ТаблицаВерсий.Колонки.Добавить("ИдентификаторВерсии" , Новый ОписаниеТипов("Строка"));
	ТаблицаВерсий.Колонки.Добавить("ПредставлениеВерсии" , Новый ОписаниеТипов("Строка"));
	ТаблицаВерсий.Колонки.Добавить("ПредставлениеАвтора" , Новый ОписаниеТипов("Строка"));
	ТаблицаВерсий.Колонки.Добавить("Дата"                , Новый ОписаниеТипов("Дата", , , 
		Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаВерсий.Колонки.Добавить("Состояние"           , Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаВерсий;
	
КонецФункции

#КонецОбласти

#Область СловарьТерминов

Функция ИдентификаторТекущейРевизииСервиса() Экспорт
	
	Возврат "lastRevision";
	
КонецФункции

Функция ПредставлениеСостоянияТекущаяРевизия() Экспорт
	Возврат НСтр("ru = 'Редактируемый документ'");
КонецФункции

#КонецОбласти

#КонецОбласти
